tutorials/incompressible/pimpleDyMFoam/wingMotion/wingMotion2D_simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          72;
        startFace       25179;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       25251;
    }
    outlet
    {
        type            patch;
        nFaces          62;
        startFace       25291;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          378;
        startFace       25353;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12565;
        startFace       25731;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12565;
        startFace       38296;
    }
)

// ************************************************************************* //
